#Написать программу, считывающую количество вхождений символов в строку.
A = input()
print('ввидите символ, который нужно найти')
d = input()
u = A.count(d)
print(u)
